# LocateSpecification Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..LocateSpecification Method
FabricationConfiguration Class See Also
---
Gets the specification identifier by group and name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int LocateSpecification(
	string group,
	string name
)
```

Visual Basic
---
```text
Public Function LocateSpecification ( _
	group As String, _
	name As String _
) As Integer
```

Visual C++
---
```text
public:
int LocateSpecification(
	String^ group,
	String^ name
)
```

# ### Parameters
group
    Type: System..::..String The specification group.
name
    Type: System..::..String The specification name.
# ### Return Value
The specification identifier. Returns -1 if not found.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace